
[]
  {}
    :days $ #{} |2026-01-01 |2026-01-02 |2026-01-03
    :name "|元旦"
    :type :holiday
  {}
    :days $ #{} |2026-01-04
    :name "|元旦"
    :type :workingday
  {}
    :days $ #{} |2026-02-14
    :name "|春节"
    :type :workingday
  {}
    :days $ #{} |2026-02-15 |2026-02-16 |2026-02-17 |2026-02-18 |2026-02-19 |2026-02-20 |2026-02-21 |2026-02-22 |2026-02-23
    :name "|春节"
    :type :holiday
  {}
    :days $ #{} |2026-02-28
    :name "|春节"
    :type :workingday
  {}
    :days $ #{} |2026-04-04 |2026-04-05 |2026-04-06
    :name "|清明节"
    :type :holiday
  {}
    :days $ #{} |2026-05-01 |2026-05-02 |2026-05-03 |2026-05-04 |2026-05-05
    :name "|劳动节"
    :type :holiday
  {}
    :days $ #{} |2026-05-09
    :name "|劳动节"
    :type :workingday
  {}
    :days $ #{} |2026-06-19 |2026-06-20 |2026-06-21
    :name "|端午节"
    :type :holiday
  {}
    :days $ #{} |2026-09-20
    :name "|中秋节"
    :type :workingday
  {}
    :days $ #{} |2026-09-25 |2026-09-26 |2026-09-27
    :name "|中秋节"
    :type :holiday
  {}
    :days $ #{} |2026-10-01 |2026-10-02 |2026-10-03 |2026-10-04 |2026-10-05 |2026-10-06 |2026-10-07
    :name "|国庆节"
    :type :holiday
  {}
    :days $ #{} |2026-10-10
    :name "|国庆节"
    :type :workingday
